html/portfolio/gui.h.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-06-10 Sat 14:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Ethan Smith" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div class="org-src-container">
<pre class="src src-c"><span class="linenr">  1: </span><span style="color: #4078f2; font-weight: bold;">#if</span><span style="color: #4078f2; font-weight: bold;">n</span><span style="color: #4078f2; font-weight: bold;">def</span> <span style="color: #b751b6;">GUI_H_</span>
<span class="linenr">  2: </span><span style="color: #4078f2; font-weight: bold;">#define</span> <span style="color: #6a1868;">GUI_H_</span>
<span class="linenr">  3: </span>
<span class="linenr">  4: </span><span style="color: #4078f2; font-weight: bold;">#include</span> <span style="color: #4078f2;">&lt;</span><span style="color: #50a14f;">ncurses.h</span><span style="color: #4078f2;">&gt;</span>
<span class="linenr">  5: </span><span style="color: #4078f2; font-weight: bold;">#include</span> <span style="color: #4078f2;">&lt;</span><span style="color: #50a14f;">stdlib.h</span><span style="color: #4078f2;">&gt;</span>
<span class="linenr">  6: </span><span style="color: #4078f2; font-weight: bold;">#include</span> <span style="color: #4078f2;">&lt;</span><span style="color: #50a14f;">string.h</span><span style="color: #4078f2;">&gt;</span>
<span class="linenr">  7: </span><span style="color: #4078f2; font-weight: bold;">#include</span> <span style="color: #4078f2;">&lt;</span><span style="color: #50a14f;">ringbuf.h</span><span style="color: #4078f2;">&gt;</span>
<span class="linenr">  8: </span>
<span class="linenr">  9: </span><span style="color: #4078f2; font-weight: bold;">#define</span> <span style="color: #6a1868;">COMMAND_PROMPT</span> <span style="color: #50a14f;">"hw11&gt; "</span>
<span class="linenr"> 10: </span>
<span class="linenr"> 11: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">GUI data structure. This structure holds all the data that the GUI needs in</span>
<span class="linenr"> 12: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">order to operate. it contains WINDOW* fields which refer to ncurses windows.</span>
<span class="linenr"> 13: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">the help and status windows have additional "master" windows. The master</span>
<span class="linenr"> 14: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">windows are a little larger than the regular window, and contain the border</span>
<span class="linenr"> 15: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">and window title.</span>
<span class="linenr"> 16: </span><span style="color: #9ca0a4;">//</span>
<span class="linenr"> 17: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">there are strings associated with the title of the status and help windows.</span>
<span class="linenr"> 18: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">This string contains additional title data. For each window the title will</span>
<span class="linenr"> 19: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">read as follows:</span>
<span class="linenr"> 20: </span><span style="color: #9ca0a4;">//  </span><span style="color: #9ca0a4;">"[window: window_title]"</span>
<span class="linenr"> 21: </span><span style="color: #9ca0a4;">//  </span><span style="color: #9ca0a4;">where "window" is either "help" or "status".</span>
<span class="linenr"> 22: </span><span style="color: #9ca0a4;">//</span>
<span class="linenr"> 23: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">To add text to the status or help windows, one should use the wprintw</span>
<span class="linenr"> 24: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">function provided by ncurses.</span>
<span class="linenr"> 25: </span><span style="color: #9ca0a4;">//</span>
<span class="linenr"> 26: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">the cmd window is used for command input. the "line_mode" option allows line</span>
<span class="linenr"> 27: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">mode to be turned on/off. When line mode is off, only one character will ever</span>
<span class="linenr"> 28: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">be entered onto the command line. with line mode on, successive key presses</span>
<span class="linenr"> 29: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">will append the typed character onto the command line.</span>
<span class="linenr"> 30: </span><span style="color: #e45649;">typedef</span> <span style="color: #e45649;">struct</span> <span style="color: #986801;">Gui</span> <span style="color: #4078f2;">{</span>
<span class="linenr"> 31: </span>    <span style="color: #986801;">WINDOW</span> *<span style="color: #6a1868;">cmd</span>;
<span class="linenr"> 32: </span>    <span style="color: #986801;">bool</span> <span style="color: #6a1868;">line_mode</span>;
<span class="linenr"> 33: </span>
<span class="linenr"> 34: </span>    <span style="color: #986801;">WINDOW</span> *<span style="color: #6a1868;">help</span>;
<span class="linenr"> 35: </span>    <span style="color: #986801;">WINDOW</span> *<span style="color: #6a1868;">status</span>;
<span class="linenr"> 36: </span>
<span class="linenr"> 37: </span>    <span style="color: #986801;">WINDOW</span> *<span style="color: #6a1868;">help_master</span>;
<span class="linenr"> 38: </span>    <span style="color: #986801;">WINDOW</span> *<span style="color: #6a1868;">status_master</span>;
<span class="linenr"> 39: </span>
<span class="linenr"> 40: </span>    <span style="color: #986801;">int</span> <span style="color: #6a1868;">status_x</span>, <span style="color: #6a1868;">status_y</span>;
<span class="linenr"> 41: </span>    <span style="color: #986801;">int</span> <span style="color: #6a1868;">help_x</span>, <span style="color: #6a1868;">help_y</span>;
<span class="linenr"> 42: </span>
<span class="linenr"> 43: </span>    <span style="color: #986801;">char</span>* <span style="color: #6a1868;">status_title</span>;
<span class="linenr"> 44: </span>    <span style="color: #986801;">char</span>* <span style="color: #6a1868;">help_title</span>;
<span class="linenr"> 45: </span><span style="color: #4078f2;">}</span> <span style="color: #986801;">Gui</span>;
<span class="linenr"> 46: </span>
<span class="linenr"> 47: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">allocate and initialize the GUI structure. This data must be free'ed at the</span>
<span class="linenr"> 48: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">end of the program using the gui_del function.</span>
<span class="linenr"> 49: </span><span style="color: #986801;">Gui</span> <span style="color: #a626a4;">gui_init</span><span style="color: #4078f2;">()</span>;
<span class="linenr"> 50: </span>
<span class="linenr"> 51: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">frees data allocated by the GUI free function, and ends ncurses instance</span>
<span class="linenr"> 52: </span><span style="color: #986801;">void</span> <span style="color: #a626a4;">gui_del</span><span style="color: #4078f2;">(</span><span style="color: #986801;">Gui</span>* <span style="color: #6a1868;">gui</span><span style="color: #4078f2;">)</span>;
<span class="linenr"> 53: </span>
<span class="linenr"> 54: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">gets input from the command line, returning the character. this is a blocking</span>
<span class="linenr"> 55: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">function. if non-blocking behavior is desired, a separate thread must be used.</span>
<span class="linenr"> 56: </span><span style="color: #986801;">char</span> <span style="color: #a626a4;">get_input</span><span style="color: #4078f2;">(</span><span style="color: #986801;">Gui</span>* <span style="color: #6a1868;">wins</span><span style="color: #4078f2;">)</span>;
<span class="linenr"> 57: </span>
<span class="linenr"> 58: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Changes the title of the status window. You cannot just replace the string in</span>
<span class="linenr"> 59: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">the structure, because the title/border isn't updated very often. this</span>
<span class="linenr"> 60: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">function updates the relative fields in the GUI structure, and then refreshes</span>
<span class="linenr"> 61: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">the window to display the changes</span>
<span class="linenr"> 62: </span><span style="color: #986801;">void</span> <span style="color: #a626a4;">status_set_title</span><span style="color: #4078f2;">(</span><span style="color: #986801;">Gui</span>* <span style="color: #6a1868;">wins</span>, <span style="color: #986801;">char</span>* <span style="color: #6a1868;">title</span><span style="color: #4078f2;">)</span>;
<span class="linenr"> 63: </span>
<span class="linenr"> 64: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">clears the contents of the window. this function updates the relavant fields</span>
<span class="linenr"> 65: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">in the gui structure, and then refreshes the window to reflect those changes.</span>
<span class="linenr"> 66: </span><span style="color: #986801;">void</span> <span style="color: #a626a4;">status_clear</span><span style="color: #4078f2;">(</span><span style="color: #986801;">Gui</span>* <span style="color: #6a1868;">wins</span><span style="color: #4078f2;">)</span>;
<span class="linenr"> 67: </span>
<span class="linenr"> 68: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Changes the title of the status window. You cannot just replace the string in</span>
<span class="linenr"> 69: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">the structure, because the title/border isn't updated very often. this</span>
<span class="linenr"> 70: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">function updates the relative fields in the GUI structure, and then refreshes</span>
<span class="linenr"> 71: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">the window to display the changes</span>
<span class="linenr"> 72: </span><span style="color: #986801;">void</span> <span style="color: #a626a4;">help_set_title</span><span style="color: #4078f2;">(</span><span style="color: #986801;">Gui</span>* <span style="color: #6a1868;">wins</span>, <span style="color: #986801;">char</span>* <span style="color: #6a1868;">title</span><span style="color: #4078f2;">)</span>;
<span class="linenr"> 73: </span>
<span class="linenr"> 74: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">clears the contents of the window. this function updates the relavant fields</span>
<span class="linenr"> 75: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">in the gui structure, and then refreshes the window to reflect those changes.</span>
<span class="linenr"> 76: </span><span style="color: #986801;">void</span> <span style="color: #a626a4;">help_clear</span><span style="color: #4078f2;">(</span><span style="color: #986801;">Gui</span>* <span style="color: #6a1868;">wins</span><span style="color: #4078f2;">)</span>;
<span class="linenr"> 77: </span>
<span class="linenr"> 78: </span><span style="color: #986801;">void</span> <span style="color: #a626a4;">wprintw_file</span><span style="color: #4078f2;">(</span><span style="color: #986801;">WINDOW</span>* <span style="color: #6a1868;">win</span>, <span style="color: #986801;">char</span>* <span style="color: #6a1868;">filename</span><span style="color: #4078f2;">)</span>;
<span class="linenr"> 79: </span>
<span class="linenr"> 80: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">command which is used to print data to the GUI. Commands that print stuff may take</span>
<span class="linenr"> 81: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">either a c string (char*), or if the c-string is NULL, then the subsequent command</span>
<span class="linenr"> 82: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">entries will be DATA packets, each of which contain the c member of the union.</span>
<span class="linenr"> 83: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">this allows data to be copied over rather than referenced.</span>
<span class="linenr"> 84: </span><span style="color: #e45649;">typedef</span> <span style="color: #e45649;">struct</span> <span style="color: #986801;">GuiCommand</span> <span style="color: #4078f2;">{</span>
<span class="linenr"> 85: </span>    <span style="color: #e45649;">enum</span> <span style="color: #986801;">GuiControl</span> <span style="color: #a626a4;">{</span>
<span class="linenr"> 86: </span>        <span style="color: #6a1868;">PRINT_HELP</span>,
<span class="linenr"> 87: </span>        <span style="color: #6a1868;">PRINT_FILE_HELP</span>,
<span class="linenr"> 88: </span>        <span style="color: #6a1868;">PRINT_STATUS</span>,
<span class="linenr"> 89: </span>        <span style="color: #6a1868;">TERMINAL_PRINT</span>,
<span class="linenr"> 90: </span>        <span style="color: #6a1868;">TERMINAL_ENTER</span>,
<span class="linenr"> 91: </span>        <span style="color: #6a1868;">TERMINAL_RETURN</span>,
<span class="linenr"> 92: </span>        <span style="color: #6a1868;">SET_TITLE_HELP</span>,
<span class="linenr"> 93: </span>        <span style="color: #6a1868;">SET_TITLE_STATUS</span>,
<span class="linenr"> 94: </span>        <span style="color: #6a1868;">CLEAR_HELP</span>,
<span class="linenr"> 95: </span>        <span style="color: #6a1868;">CLEAR_STATUS</span>,
<span class="linenr"> 96: </span>        <span style="color: #6a1868;">REFRESH</span>,
<span class="linenr"> 97: </span>        <span style="color: #6a1868;">CMD_ECHO_ON</span>,
<span class="linenr"> 98: </span>        <span style="color: #6a1868;">CMD_ECHO_OFF</span>,
<span class="linenr"> 99: </span>        <span style="color: #6a1868;">GUI_EXIT</span>,
<span class="linenr">100: </span>
<span class="linenr">101: </span>        <span style="color: #6a1868;">DATA</span>
<span class="linenr">102: </span>    <span style="color: #a626a4;">}</span> <span style="color: #6a1868;">cmd</span>;
<span class="linenr">103: </span>
<span class="linenr">104: </span>    <span style="color: #e45649;">union</span> <span style="color: #a626a4;">{</span>
<span class="linenr">105: </span>        <span style="color: #986801;">char</span>* <span style="color: #6a1868;">data</span>;
<span class="linenr">106: </span>        <span style="color: #986801;">char</span> <span style="color: #6a1868;">c</span>;
<span class="linenr">107: </span>    <span style="color: #a626a4;">}</span>;
<span class="linenr">108: </span>
<span class="linenr">109: </span><span style="color: #4078f2;">}</span> <span style="color: #986801;">GuiCommand</span>;
<span class="linenr">110: </span>
<span class="linenr">111: </span><span style="color: #e45649;">struct</span> <span style="color: #986801;">GuiThreadParams</span> <span style="color: #4078f2;">{</span>
<span class="linenr">112: </span>    <span style="color: #986801;">Producer</span>* <span style="color: #6a1868;">input_rb</span>;
<span class="linenr">113: </span>    <span style="color: #986801;">Consumer</span>* <span style="color: #6a1868;">command_rb</span>;
<span class="linenr">114: </span><span style="color: #4078f2;">}</span>;
<span class="linenr">115: </span>
<span class="linenr">116: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">helper function to fascilitate printing and otherwise controlling the GUI</span>
<span class="linenr">117: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">from other threads</span>
<span class="linenr">118: </span><span style="color: #9ca0a4;">//</span>
<span class="linenr">119: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">for the window refresh command, an optional string can be provided to refresh</span>
<span class="linenr">120: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">specific windows.</span>
<span class="linenr">121: </span><span style="color: #9ca0a4;">//</span>
<span class="linenr">122: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">'s' = status</span>
<span class="linenr">123: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">'h' = help</span>
<span class="linenr">124: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">'c' = command</span>
<span class="linenr">125: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">'S' = status border</span>
<span class="linenr">126: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">'H' = help border</span>
<span class="linenr">127: </span><span style="color: #9ca0a4;">//</span>
<span class="linenr">128: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">multiple windows can be refreshed in the same command string, for example,</span>
<span class="linenr">129: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">all the following are valid:</span>
<span class="linenr">130: </span><span style="color: #9ca0a4;">//</span>
<span class="linenr">131: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">"shc"</span>
<span class="linenr">132: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">"Ss"</span>
<span class="linenr">133: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">"SH"</span>
<span class="linenr">134: </span><span style="color: #9ca0a4;">//</span>
<span class="linenr">135: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">one thing to note is that all three of the following will refresh all of the</span>
<span class="linenr">136: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">windows in one command:</span>
<span class="linenr">137: </span><span style="color: #9ca0a4;">//</span>
<span class="linenr">138: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">"shcSH"</span>
<span class="linenr">139: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">""</span>
<span class="linenr">140: </span><span style="color: #9ca0a4;">//   </span><span style="color: #9ca0a4;">NULL</span>
<span class="linenr">141: </span><span style="color: #9ca0a4;">//</span>
<span class="linenr">142: </span><span style="color: #986801;">void</span> <span style="color: #a626a4;">gui_command</span><span style="color: #4078f2;">(</span><span style="color: #986801;">Producer</span>* <span style="color: #6a1868;">gui_cmd</span>, <span style="color: #e45649;">enum</span> <span style="color: #986801;">GuiControl</span> <span style="color: #6a1868;">ctrl</span>, <span style="color: #986801;">char</span>* <span style="color: #6a1868;">data</span><span style="color: #4078f2;">)</span>;
<span class="linenr">143: </span>
<span class="linenr">144: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">neat function to package and send a GUI command, however, this function will</span>
<span class="linenr">145: </span><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">copy the data in the data string instead of passing a pointer.</span>
<span class="linenr">146: </span><span style="color: #986801;">void</span> <span style="color: #a626a4;">gui_print_cmd</span><span style="color: #4078f2;">(</span><span style="color: #986801;">Producer</span>* <span style="color: #6a1868;">gui_cmd</span>, <span style="color: #e45649;">enum</span> <span style="color: #986801;">GuiControl</span> <span style="color: #6a1868;">ctrl</span>, <span style="color: #986801;">char</span>* <span style="color: #6a1868;">data</span><span style="color: #4078f2;">)</span>;
<span class="linenr">147: </span>
<span class="linenr">148: </span>
<span class="linenr">149: </span>
<span class="linenr">150: </span><span style="color: #986801;">void</span> <span style="color: #a626a4;">gui_thread</span><span style="color: #4078f2;">(</span><span style="color: #e45649;">struct</span> <span style="color: #986801;">GuiThreadParams</span>* <span style="color: #6a1868;">params</span><span style="color: #4078f2;">)</span>;
<span class="linenr">151: </span>
<span class="linenr">152: </span><span style="color: #4078f2; font-weight: bold;">#endif</span> <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">GUI_H_</span>
</pre>
</div>
</div>
</body>
</html>